lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-usart.c
/*
 * Copyright (c) 2026 Oray Inc. All rights reserved.
 * Copyright (C) 2022-2026 OraySZ / OrayOS-Team.
 *
 * This work is licensed under CC BY-NC-SA 4.0.
 * To view a copy of this license, visit:
 * https://creativecommons.org/licenses/by-nc-sa/4.0/
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *
 * File:     ch32-usart.c
 * Author:   lintel <lintel.huang@gmail.com>
 * Date:     2026-04-18
 *
 * Description:
 *     CH32 USART1 完整仿真（手册第 18 章，CH32FV2x_V3xRM）
 *
 *     寄存器布局（每项物理宽 16 位，32 位地址对齐）：
 *       +0x00  STATR  状态寄存器
 *       +0x04  DATAR  数据寄存器（读=RDR，写=TDR）
 *       +0x08  BRR    波特率寄存器
 *       +0x0C  CTLR1  控制寄存器1
 *       +0x10  CTLR2  控制寄存器2
 *       +0x14  CTLR3  控制寄存器3
 *       +0x18  GPR    保护时间/预分频
 *       +0x1C  CTRL4  MARK/SPACE 校验（批号限定）
 *
 *     实现要点：
 *       - RX FIFO 64 字节：缓冲从 char backend 收到的字节，逐字节呈现给固件。
 *       - TX FIFO 64 字节：固件写 DATAR 进 FIFO，由 tx_timer 异步 drain 到 backend。
 *       - STATR：TXE/TC 反映 TX FIFO 状态；RXNE 反映 RX FIFO 非空；
 *         软件写 0 可清 TC/RXNE/CTS/LBD（RW0 位）。
 *       - 中断路由：RXNEIE、TXEIE、TCIE 分别对应 CTLR1 位 5/7/6，
 *         通过 wch_evt_mcause_override=53 + MIP_MEIP 路由给固件 ISR。
 *       - 宽松模式：UE=0 时 TXE/TC 仍置 1，允许未初始化直接 putc。
 */

#include "ch32-machine-internal.h"

/* =========================================================
 * STATR 位掩码（手册表 5.1，偏移 0x00）
 * ========================================================= */
#define STATR_PE      (1u <<  0)  /* 奇偶校验错  RO */
#define STATR_FE      (1u <<  1)  /* 帧错误      RO */
#define STATR_NE      (1u <<  2)  /* 噪声        RO */
#define STATR_ORE     (1u <<  3)  /* 过载错误    RO */
#define STATR_IDLE    (1u <<  4)  /* 总线空闲    RO */
#define STATR_RXNE    (1u <<  5)  /* 接收非空    RW0 */
#define STATR_TC      (1u <<  6)  /* 发送完成    RW0 */
#define STATR_TXE     (1u <<  7)  /* TDR 空      RO（写 DATAR 清） */
#define STATR_LBD     (1u <<  8)  /* LIN Break   RW0 */
#define STATR_CTS     (1u <<  9)  /* nCTS 变化   RW0 */
/* bit10=RX_BUSY, bit11=MS_ERR（批号限定，忽略） */

/* 软件写 0 可清的位（RW0）：RXNE / TC / LBD / CTS */
#define STATR_W0C_MASK (STATR_RXNE | STATR_TC | STATR_LBD | STATR_CTS)

/* CTLR1 中断使能位 */
#define CTLR1_SBK     (1u <<  0)
#define CTLR1_RWU     (1u <<  1)
#define CTLR1_RE      (1u <<  2)
#define CTLR1_TE      (1u <<  3)
#define CTLR1_IDLEIE  (1u <<  4)
#define CTLR1_RXNEIE  (1u <<  5)
#define CTLR1_TCIE    (1u <<  6)
#define CTLR1_TXEIE   (1u <<  7)
#define CTLR1_PEIE    (1u <<  8)
#define CTLR1_UE      (1u << 13)

/* TX drain 间隔（纳秒）：约 1 个仿真字节的时间，足够快但不浪费 CPU */
#define CH32_USART1_TX_DRAIN_NS 10000LL

/* CTLR3 DMA 控制位（手册表 18-4） */
#define CTLR3_DMAR    (1u << 6)   /* RX DMA 使能 */
#define CTLR3_DMAT    (1u << 7)   /* TX DMA 使能 */

/*
 * CH32V307/317 USART DMA 通道映射（手册 Table 6-2）
 * USART1 TX: DMA1_Ch4  IRQ 30 (pfic_ienr[0] bit30)
 * USART1 RX: DMA1_Ch5  IRQ 31 (pfic_ienr[0] bit31)
 * USART2 TX: DMA1_Ch7  IRQ 33 (pfic_ienr[1] bit1)
 * USART2 RX: DMA1_Ch6  IRQ 32 (pfic_ienr[1] bit0)
 * USART3 TX: DMA1_Ch2  IRQ 28 (pfic_ienr[0] bit28)
 * USART3 RX: DMA1_Ch3  IRQ 29 (pfic_ienr[0] bit29)
 */
#define CH32_USART1_DMA_TX_CH   4u   /* DMA1 Ch4 索引在 ch1[]中 = ch-1 = 3 */
#define CH32_USART1_DMA_RX_CH   5u   /* DMA1 Ch5 索引 = 4 */
#define CH32_USART1_DMA_TX_IRQ  30u
#define CH32_USART1_DMA_RX_IRQ  31u
#define CH32_USART2_DMA_TX_CH   7u   /* DMA1 Ch7 索引 = 6 */
#define CH32_USART2_DMA_RX_CH   6u   /* DMA1 Ch6 索引 = 5 */
#define CH32_USART2_DMA_TX_IRQ  33u
#define CH32_USART2_DMA_RX_IRQ  32u
#define CH32_USART3_DMA_TX_CH   2u   /* DMA1 Ch2 索引 = 1 */
#define CH32_USART3_DMA_RX_CH   3u   /* DMA1 Ch3 索引 = 2 */
#define CH32_USART3_DMA_TX_IRQ  28u
#define CH32_USART3_DMA_RX_IRQ  29u

/* =========================================================
 * 内部工具函数
 * ========================================================= */

static bool ch32_usart1_rx_enabled(const Ch32MachineState *m)
{
    return (m->usart1.ctlr1 & CTLR1_UE) &&
           (m->usart1.ctlr1 & CTLR1_RE);
}

/* RX FIFO 辅助 */
static bool ch32_rxfifo_empty(const Ch32MachineState *m)
{
    return m->usart1.rx_head == m->usart1.rx_tail;
}

static bool ch32_rxfifo_full(const Ch32MachineState *m)
{
    return ((m->usart1.rx_tail + 1) % CH32_USART1_RXFIFO_DEPTH)
           == m->usart1.rx_head;
}

/* TX FIFO 辅助 */
static bool ch32_txfifo_empty(const Ch32MachineState *m)
{
    return m->usart1.tx_head == m->usart1.tx_tail;
}

static bool ch32_txfifo_full(const Ch32MachineState *m)
{
    return ((m->usart1.tx_tail + 1) % CH32_USART1_TXFIFO_DEPTH)
           == m->usart1.tx_head;
}

/* =========================================================
 * STATR 硬件当前值
 * ========================================================= */
static uint16_t ch32_usart1_statr_hw(const Ch32MachineState *m)
{
    uint16_t st = m->usart1.statr;

    /*
     * 动态位：RXNE / TXE / TC 由 FIFO 状态实时派生，
     * 其他位（ORE/FE/NE/PE 等）保存在 statr 字段中由事件置位。
     *
     * RXNE：RX FIFO 非空。
     * TXE ：TX FIFO 非满（可以再写一字节）或 UE=0（宽松模式）。
     * TC  ：TX FIFO 已空且最后一字节发完（tx_complete）。
     *
     * 宽松模式：UE=0 或 TE=0 时 TXE|TC 始终为 1，
     * 允许固件未配置 USART 时直接用轮询方式 putc（调试常见）。
     */
    bool ue = (m->usart1.ctlr1 & CTLR1_UE) != 0;
    bool te = (m->usart1.ctlr1 & CTLR1_TE) != 0;

    /* 清掉动态位，再根据当前状态重新置 */
    st &= (uint16_t)~(STATR_RXNE | STATR_TXE | STATR_TC);

    if (!ch32_rxfifo_empty(m)) {
        st |= STATR_RXNE;
    }
    if (!ue || (ue && te)) {
        /* UE=0（宽松）或 UE+TE 都使能：根据 TX FIFO 状态 */
        if (!ue || m->usart1.tx_empty) {
            st |= STATR_TXE;
        }
        if (!ue || m->usart1.tx_complete) {
            st |= STATR_TC;
        }
    }

    return st;
}

/* =========================================================
 * 中断同步：将 USART1 中断状态同步到 MEIP
 *
 * 触发条件（任一为真则置 MEIP）：
 *   RXNEIE && RXNE     — 接收非空
 *   TXEIE  && TXE      — 发送缓冲空
 *   TCIE   && TC       — 发送完成
 *
 * 重入保护：若 pfic_iactr 中 IRQ 53 已激活（正在被服务），
 * 则不重复触发。这模拟真实 PFIC 硬件在 IRQ handler 执行期间
 * 阻止同一 IRQ 重入的行为（类似 ARM Cortex-M IACTR 机制）。
 * ========================================================= */
void ch32_usart1_meip_resync(Ch32MachineState *m)
{
    RISCVCPU *cpu = &m->cpus.harts[0];
    CPURISCVState *env = &cpu->env;
    const unsigned n   = CH32_USART1_NVIC_IRQ;   /* 53 */
    const unsigned wd  = n / 32u;                 /* 1  */
    const unsigned bit = n % 32u;                 /* 21 */
    bool ienr_on = (m->pfic_ienr[wd] >> bit) & 1u;

