lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-usart.c
    uint16_t st = ch32_usart1_statr_hw(m);
    uint32_t c1 = m->usart1.ctlr1;

    bool irq =  ienr_on && (
                ((c1 & CTLR1_RXNEIE) && (st & STATR_RXNE)) ||
                ((c1 & CTLR1_TXEIE)  && (st & STATR_TXE))  ||
                ((c1 & CTLR1_TCIE)   && (st & STATR_TC)));

    BQL_LOCK_GUARD();

    if (irq) {
        /*
         * MEIP 仲裁：如果其他外设已持有 MEIP override，则不覆盖。
         * 等对方 IRQ 处理完调用 ch32_pfic_resync_pending_meip 时，
         * 会重新进入本函数完成注入（与 ETH/ETH10M/TIM 路径一致）。
         */
        if (env->wch_evt_mcause_override != 0u &&
            env->wch_evt_mcause_override != n) {
            return;
        }
        env->mie |= MIP_MEIP;  /* PFIC IENR 控制，不需固件写 mie CSR */
        env->wch_evt_mcause_override = n;
        ch32_pfic_irq_active_set(m, n);
        riscv_cpu_update_mip(env, MIP_MEIP, MIP_MEIP);
    } else {
        if (env->wch_evt_mcause_override == n) {
            /*
             * 判断 ISR 是否仍在执行（wch_vtf_in_isr > 0）。
             *
             * 若 ISR 尚未 mret（wch_vtf_in_isr > 0）：
             *   仅撤销 MIP.MEIP，防止 CPU 重入同一中断，但不清除
             *   wch_evt_mcause_override 也不清 iactr。
             *   原因：wch_vtf_async_vec_word() 在下次 MEIP 触发时需要用
             *   wch_evt_mcause_override 查 EVT 字表得到正确的 ISR 入口（索引53）；
             *   若此处提前清零，再次触发 MEIP 时将退化到 cause=IRQ_M_EXT=11，
             *   跳入错误的向量，导致 msh 命令输入的后续字节无法被正确处理。
             *
             * 若 ISR 已退出（wch_vtf_in_isr == 0，通常由 mret→wch_vtf_exit 触发）：
             *   正常清除所有状态，并重新扫描其他外设。
             */
            if (env->wch_vtf_in_isr > 0) {
                /* ISR 执行中：只撤 MEIP，保留 owner/iactr */
                riscv_cpu_update_mip(env, MIP_MEIP, 0);
            } else {
                /* ISR 已退出：完整清理并重新扫描 */
                riscv_cpu_update_mip(env, MIP_MEIP, 0);
                env->wch_evt_mcause_override = 0;
                ch32_pfic_irq_active_clear(m, n);
                /*
                 * USART1 中断处理完成（IRQ 降低）：
                 * 重新扫描其他外设以及 USART1 自身（若还有剩余字节）的中断请求。
                 */
                ch32_pfic_resync_pending_meip(m);
            }
        }
    }
    riscv_cpu_interrupt(env);
}

/* =========================================================
 * TX FIFO drain（由定时器驱动）
 *
 * 每次触发时尽量将 TX FIFO 中的所有字节一次性写入 char backend，
 * 写完后更新 tx_empty / tx_complete / STATR，并重新同步中断。
 * 若 backend 不可写（缓冲满），重新arm定时器稍后再试。
 * ========================================================= */
static void ch32_usart1_tx_drain(void *opaque)
{
    Ch32MachineState *m = opaque;
    bool changed = false;

    while (!ch32_txfifo_empty(m)) {
        uint8_t ch = m->usart1.tx_buf[m->usart1.tx_head];
        int n = qemu_chr_fe_write(&m->usart1.chr, &ch, 1);
        if (n <= 0) {
            /* backend 暂时不可写，稍后重试 */
            timer_mod(m->usart1.tx_timer,
                      qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) +
                      CH32_USART1_TX_DRAIN_NS);
            goto done;
        }
        m->usart1.tx_head = (m->usart1.tx_head + 1) % CH32_USART1_TXFIFO_DEPTH;
        changed = true;
    }

    /* TX FIFO 已空 */
    if (changed || !m->usart1.tx_empty) {
        m->usart1.tx_empty    = true;
        m->usart1.tx_complete = true;
        changed = true;
    }

done:
    if (changed) {
        ch32_usart1_meip_resync(m);
    }
}

/* =========================================================
 * char backend 回调：can_receive
 * ========================================================= */
static int ch32_usart1_can_receive(void *opaque)
{
    Ch32MachineState *m = opaque;

    if (!qemu_chr_fe_backend_connected(&m->usart1.chr)) {
        return 0;
    }
    /*
     * 不以 rx_enabled (UE+RE) 作为门控。
     *
     * 原因：stdio backend 在 can_receive() 返回 0 后会撤销对 stdin fd 的监听，
     * 即使后续固件使能了 RE，除非有主动 accept_input 触发，否则 stdin
     * 将永久沉默。这导致在原生终端下键盘输入完全失效。
     *
     * 正确做法：只要 stage 缓冲有空间就告知 backend 可以接收；receive() 回调内
     * 再判断 rx_enabled，UE+RE=0 时把字节丢弃即可。
     *
     * 注意：这里检查的是 rx_stage_buf 的剩余容量，不是 rx_buf。
     * rx_stage_buf 是 backend -> QEMU 的消化缓冲，rx_buf 是 QEMU -> 固件的 FIFO。
     */
    {
        unsigned used = (m->usart1.rx_stage_tail + CH32_USART1_RXFIFO_DEPTH
                         - m->usart1.rx_stage_head) % CH32_USART1_RXFIFO_DEPTH;
        return (used < CH32_USART1_RXFIFO_DEPTH - 1) ? 1 : 0;
    }
}

/* =========================================================
 * char backend 回调：receive
 *
 * 所有字节先入 rx_stage_buf，由 rx_timer 逐字节投喂到 rx_buf。
 * 这模拟真实串口的字节间隔，确保每个字节都能单独触发一次 IRQ。
 * ========================================================= */
static void ch32_usart1_receive(void *opaque, const uint8_t *buf, int size)
{
    Ch32MachineState *m = opaque;
    int i;

    if (size < 1) {
        return;
    }
    /* UE+RE 未使能：丢弃字节但保持 backend 监听 */
    if (!ch32_usart1_rx_enabled(m)) {
        return;
    }
    /* 将字节导入 stage 缓冲 */
    for (i = 0; i < size; i++) {
        unsigned next = (m->usart1.rx_stage_tail + 1) % CH32_USART1_RXFIFO_DEPTH;
        if (next == m->usart1.rx_stage_head) {
            break;  /* stage 满，丢弃 */
        }
        m->usart1.rx_stage_buf[m->usart1.rx_stage_tail] = buf[i];
        m->usart1.rx_stage_tail = next;
    }
    /* 如果 rx_timer 还没在跑，立即启动第一次投喂 */
    if (!timer_pending(m->usart1.rx_timer)) {
        timer_mod(m->usart1.rx_timer,
                  qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL));
    }
}

/* =========================================================
 * 唤醒 RX backend（FIFO 有空间时）
 * ========================================================= */
static void ch32_usart1_try_accept_rx(Ch32MachineState *m)
{
    if (qemu_chr_fe_backend_connected(&m->usart1.chr) &&
        ch32_usart1_rx_enabled(m) && !ch32_rxfifo_full(m)) {
        qemu_chr_fe_accept_input(&m->usart1.chr);
    }
}

/* =========================================================
 * DMA 辅助工具：向 DMA 内存目标地址写入一个字节
 * ========================================================= */
static void ch32_dma_write_byte(Ch32DmaChannel *ch, uint8_t byte)
{
    AddressSpace *as = &address_space_memory;
    uint8_t  buf8  = byte;
    uint16_t buf16 = byte;
    uint32_t buf32 = byte;
    unsigned msize = (ch->cfgr >> 10) & 3u;  /* MSIZE 字段 */

    switch (msize) {
    case 1:
        address_space_write(as, ch->maddr, MEMTXATTRS_UNSPECIFIED, &buf16, 2);
        if (ch->cfgr & (1u << 7)) { ch->maddr += 2; }  /* MINC */
        break;
    case 2:
        address_space_write(as, ch->maddr, MEMTXATTRS_UNSPECIFIED, &buf32, 4);
        if (ch->cfgr & (1u << 7)) { ch->maddr += 4; }  /* MINC */
        break;
    default: /* MSIZE=00: byte */
        address_space_write(as, ch->maddr, MEMTXATTRS_UNSPECIFIED, &buf8, 1);
        if (ch->cfgr & (1u << 7)) { ch->maddr += 1; }  /* MINC */
        break;
    }
}

/* =========================================================
 * ch32_dma_finish_channel - DMA 通道传输完成公共逻辑
 *
 * 置位 INTFR（TCIF+GIF）、清 EN、如果 TCIE=1 触发 IRQ。
 * intfr_reg  : 指向对应 DMA 的 INTFR 寄存器
 * ch_local   : 该通道在其 DMA 控制器内的编号（1-based）
 * irq_n      : 该通道对应的 PFIC IRQ 号
 * ========================================================= */
static void ch32_dma_finish_channel(Ch32MachineState *m, Ch32DmaChannel *ch,
                                    uint32_t *intfr_reg, unsigned ch_local,
                                    unsigned irq_n)
{
    unsigned gif_bit  = ((ch_local - 1u) * 4u);
    unsigned tcif_bit = ((ch_local - 1u) * 4u + 1u);

    ch->cntr = 0;
    ch->cfgr &= ~(1u << 0);  /* 清 EN */
    *intfr_reg |= (1u << gif_bit) | (1u << tcif_bit);

    if (ch->cfgr & (1u << 1)) {  /* TCIE */
        /* 复用 ch32_dma.c 中的 ch32_dma_fire_irq 需要外部调用——
         * 此处直接内联实现同样的逻辑 */
        RISCVCPU *cpu = &m->cpus.harts[0];
        CPURISCVState *env = &cpu->env;
        unsigned wd  = irq_n / 32u;
        unsigned bit = irq_n % 32u;
        bool ienr_on = (m->pfic_ienr[wd] >> bit) & 1u;

        BQL_LOCK_GUARD();
        if (ienr_on && env->wch_evt_mcause_override == 0) {
            env->mie |= MIP_MEIP;
            env->wch_evt_mcause_override = irq_n;
            riscv_cpu_update_mip(env, MIP_MEIP, MIP_MEIP);
            riscv_cpu_interrupt(env);
        }
    }
}

/* =========================================================
 * ch32_usart1_dma_rx_pump - USART1 RXNE 驱动 DMA RX 字节搬运
 *
 * 每当 USART1 RX FIFO 有新字节到达（rx_tick 投嗂后）即调用。
 * 若 DMAR=1 且 DMA1_Ch5 的 PADDR 指向 USART1 DATAR，则仿真 RXNE 驱动
 * DMA 搬运一个字节到内存（不再经过 USART IRQ 路径）。
 * ========================================================= */
void ch32_usart1_dma_rx_pump(Ch32MachineState *m)
{
    Ch32DmaChannel *ch;
    uint32_t datar_base;
    uint8_t byte;

    /* 检查 DMAR 位 */
    if (!(m->usart1.ctlr3 & CTLR3_DMAR)) {
        return;
    }
    /* DMA1_Ch5 索引 = CH32_USART1_DMA_RX_CH - 1 = 4 */
    ch = &m->dma.ch1[CH32_USART1_DMA_RX_CH - 1];

    if (!(ch->cfgr & (1u << 0))) {
        return;  /* EN 未置 */
    }
    if (ch->cntr == 0) {
        return;  /* 传输计数已退，无需搞运 */
    }
    /*
     * 验证 PADDR 是否指向 USART1 DATAR（限制在 USART1 地址范围内）。
     * 允许偏移 0~3，匹配 1/2/4 字节对齐讻取 DATAR。
     */
    datar_base = (uint32_t)CH32_USART1_BASE;
    if (ch->paddr < datar_base + 0x04u || ch->paddr > datar_base + 0x07u) {
        return;  /* PADDR 不指向 USART1 DATAR，跳过 */
    }

    /* USART1 RX FIFO 为空：无字节可搬运 */
    if (ch32_rxfifo_empty(m)) {
        return;
    }

    /* 从 RX FIFO 取出一个字节 */
    byte = m->usart1.rx_buf[m->usart1.rx_head];
    m->usart1.rx_head = (m->usart1.rx_head + 1) % CH32_USART1_RXFIFO_DEPTH;
    m->usart1.rx_pending = !ch32_rxfifo_empty(m);
    if (m->usart1.rx_pending) {
        m->usart1.rdr = m->usart1.rx_buf[m->usart1.rx_head];
    }
    /* 清 RXNE 模拟硬件被 DMA 读走 */
    m->usart1.statr &= (uint16_t)~STATR_RXNE;

    /* 将字节写入内存目标 */
    ch32_dma_write_byte(ch, byte);
    ch->cntr--;

    /* 若传输计数归零：完成传输 */
    if (ch->cntr == 0) {
        ch32_dma_finish_channel(m, ch, &m->dma.intfr[0],
                                CH32_USART1_DMA_RX_CH, CH32_USART1_DMA_RX_IRQ);
    }
}

/* =========================================================
 * RX 节拍定时器回调：每次投嗂一个字节到 rx_buf
 * ========================================================= */
static void ch32_usart1_rx_tick(void *opaque)
{
    Ch32MachineState *m = opaque;
    uint8_t ch;

    /* stage 空：无事可做 */
    if (m->usart1.rx_stage_head == m->usart1.rx_stage_tail) {
        return;
    }
    /* rx_buf 满：稍后重试 */
    if (ch32_rxfifo_full(m)) {
        timer_mod(m->usart1.rx_timer,
                  qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + CH32_USART1_RX_BYTE_NS);
        return;
    }

    /* 取出一个字节 */
    ch = m->usart1.rx_stage_buf[m->usart1.rx_stage_head];
    m->usart1.rx_stage_head = (m->usart1.rx_stage_head + 1) % CH32_USART1_RXFIFO_DEPTH;

    /* 写入 rx_buf */
    m->usart1.rx_buf[m->usart1.rx_tail] = ch;
    m->usart1.rx_tail = (m->usart1.rx_tail + 1) % CH32_USART1_RXFIFO_DEPTH;
    m->usart1.rx_pending = true;
    m->usart1.rdr = m->usart1.rx_buf[m->usart1.rx_head];

    /* 触发 IRQ 或 DMA RX 握手
     *
     * 如果 DMAR=1 且 DMA1_Ch5 已配置，由 DMA pump 搞运字节（跳过 USART IRQ）；
     * 否则按常规触发 USART1 RXNE 中断。
     */
    if (m->usart1.ctlr3 & CTLR3_DMAR) {
        ch32_usart1_dma_rx_pump(m);
    } else {
        ch32_usart1_meip_resync(m);
    }

    /* 如果 stage 还有剩余字节，安排下一次投喂 */
    if (m->usart1.rx_stage_head != m->usart1.rx_stage_tail) {
        timer_mod(m->usart1.rx_timer,
                  qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + CH32_USART1_RX_BYTE_NS);
    } else {
        /* stage 清空，通知 backend 可以再发 */
        ch32_usart1_try_accept_rx(m);
    }
}

/* =========================================================
 * MMIO 读
 * ========================================================= */
static uint64_t ch32_usart1_read(void *opaque, hwaddr addr, unsigned size)
{
    Ch32MachineState *m = opaque;

    switch (addr) {
    case 0x00: /* STATR */
        {
            uint16_t st = ch32_usart1_statr_hw(m);
            return (size == 1) ? (st & 0xffu) : st;
        }

    case 0x04: /* DATAR 读 = RDR */
        {
            /*
             * 读 DATAR：弹出 RX FIFO 头字节，清 RXNE（当 FIFO 变空时），
             * 若 ORE=1 则同时清 ORE（读 STATR 再读 DATAR 清除序列）。
             * 若 FIFO 已空则返回 0（不改变任何状态）。
             */
            uint32_t ret = 0;

            if (m->usart1.rx_pending) {
                ret = m->usart1.rdr;
                m->usart1.rx_head = (m->usart1.rx_head + 1) % CH32_USART1_RXFIFO_DEPTH;
                m->usart1.rx_pending = !ch32_rxfifo_empty(m);
                if (m->usart1.rx_pending) {
                    m->usart1.rdr = m->usart1.rx_buf[m->usart1.rx_head];
                }
                /* 清 RXNE（已由 statr_hw 动态派生，但写 0 软件清 bit 需一致） */
                m->usart1.statr &= (uint16_t)~STATR_RXNE;
                /* 清 ORE（读 STATR+DATAR 序列清除） */
                m->usart1.statr &= (uint16_t)~STATR_ORE;
            }
            ch32_usart1_meip_resync(m);
            /* 尝试通知 backend 可以再发数据 */
            ch32_usart1_try_accept_rx(m);
            return (size == 1) ? (ret & 0xffu) : ret;
        }

    case 0x08: return m->usart1.brr;
    case 0x0c: return m->usart1.ctlr1;
    case 0x10: return m->usart1.ctlr2;
    case 0x14: return m->usart1.ctlr3;
    case 0x18: return m->usart1.gpr;
    case 0x1c: return m->usart1.ctlr4;
    default:   break;
    }
    ch32_mmio_log_bad_offset("usart1", addr, size, false);
    return 0;
}

/* =========================================================
 * MMIO 写
 * ========================================================= */
static void ch32_usart1_write(void *opaque, hwaddr addr, uint64_t val,
                               unsigned size)
{
    Ch32MachineState *m = opaque;
    uint32_t v = (uint32_t)val;

    (void)size;

    switch (addr) {
    case 0x00: /* STATR 写：只允许对 RW0 位写 0 清标志 */
        /*
         * 手册：TC/RXNE/LBD/CTS 为 RW0，软件写 0 可清。
         * 其余位（TXE/IDLE/ORE 等）为 RO，写操作被忽略。
         * 实现：保留 statr 中非 RW0 的位不变，对 RW0 位按写入值清零。
         */
        {
            uint16_t clr = (uint16_t)(~v & STATR_W0C_MASK); /* 写 0 = 清 */
            m->usart1.statr &= (uint16_t)~clr;
            ch32_usart1_meip_resync(m);
        }
        return;

    case 0x04: /* DATAR 写 = TDR */
        {
            /*
             * 固件写 DATAR：
             *   1. 将字节放入 TX FIFO。
             *   2. TXE 清（FIFO 非空）；TC 清（尚未发完）。
             *   3. 如果 UE=0（宽松模式），直接同步写入 backend（不过 FIFO）。
             *   4. 启动 tx_timer 触发异步 drain。
             */
            bool ue = (m->usart1.ctlr1 & CTLR1_UE) != 0;
            uint8_t ch = (uint8_t)(v & 0xffu);

            if (!ue) {
                /* 宽松模式：直接写 backend，保持 TXE|TC=1 */
                (void)qemu_chr_fe_write_all(&m->usart1.chr, &ch, 1);
                /* TXE/TC 保持 1（由 statr_hw 宽松逻辑保证） */
                ch32_usart1_meip_resync(m);
                return;
            }

