lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-usart.c
            if (!ch32_txfifo_full(m)) {
                m->usart1.tx_buf[m->usart1.tx_tail] = ch;
                m->usart1.tx_tail = (m->usart1.tx_tail + 1) % CH32_USART1_TXFIFO_DEPTH;
                m->usart1.tx_empty    = false;
                m->usart1.tx_complete = false;
            }
            /* 清 STATR.TC（软件写 DATAR 清，参见手册表 18-1） */
            m->usart1.statr &= (uint16_t)~STATR_TC;

            /* 启动 drain 定时器（若未 arm） */
            if (!timer_pending(m->usart1.tx_timer)) {
                timer_mod(m->usart1.tx_timer,
                          qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) +
                          CH32_USART1_TX_DRAIN_NS);
            }
            ch32_usart1_meip_resync(m);
        }
        return;

    case 0x08:
        m->usart1.brr = v;
        return;

    case 0x0c: /* CTLR1 */
        m->usart1.ctlr1 = v;
        /*
         * UE/RE/TE/RXNEIE/TXEIE/TCIE 可能变化。
         * 若 TE 变为使能，从 tx_empty/tc 状态触发 TXEIE/TCIE。
         * 重新 accept RX input 并同步中断。
         */
        ch32_usart1_try_accept_rx(m);
        ch32_usart1_meip_resync(m);
        return;

    case 0x10:
        m->usart1.ctlr2 = v;
        return;

    case 0x14:
        m->usart1.ctlr3 = v;
        return;

    case 0x18:
        m->usart1.gpr = v;
        return;

    case 0x1c:
        m->usart1.ctlr4 = v;
        return;

    default:
        ch32_mmio_log_bad_offset("usart1", addr, size, true);
        return;
    }
}

/* =========================================================
 * MemoryRegion ops
 * ========================================================= */
static const MemoryRegionOps ch32_usart1_ops = {
    .read  = ch32_usart1_read,
    .write = ch32_usart1_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
    },
};

/* =========================================================
 * ch32_usart1_reset
 * ========================================================= */
void ch32_usart1_reset(Ch32MachineState *m)
{
    RISCVCPU *cpu = &m->cpus.harts[0];
    CPURISCVState *env = &cpu->env;

    /* 手册复位值：STATR=0x00C0（TXE=1,TC=1），其余=0 */
    m->usart1.statr    = (uint16_t)(STATR_TXE | STATR_TC);
    m->usart1.brr      = 0;
    m->usart1.ctlr1    = 0;
    m->usart1.ctlr2    = 0;
    m->usart1.ctlr3    = 0;
    m->usart1.gpr      = 0;
    m->usart1.ctlr4    = 0;

    /* RX FIFO */
    m->usart1.rx_head    = 0;
    m->usart1.rx_tail    = 0;
    m->usart1.rx_pending = false;
    m->usart1.rdr        = 0;
    memset(m->usart1.rx_buf, 0, sizeof(m->usart1.rx_buf));

    /* RX stage 缓冲 */
    m->usart1.rx_stage_head = 0;
    m->usart1.rx_stage_tail = 0;
    memset(m->usart1.rx_stage_buf, 0, sizeof(m->usart1.rx_stage_buf));

    /* 停止 RX 节拍定时器 */
    if (m->usart1.rx_timer) {
        timer_del(m->usart1.rx_timer);
    }

    /* TX FIFO */
    m->usart1.tx_head     = 0;
    m->usart1.tx_tail     = 0;
    m->usart1.tx_empty    = true;
    m->usart1.tx_complete = true;
    memset(m->usart1.tx_buf, 0, sizeof(m->usart1.tx_buf));

    /* 停止 TX drain 定时器 */
    if (m->usart1.tx_timer) {
        timer_del(m->usart1.tx_timer);
    }

    /*
     * 撤销挂起的 USART1 MEIP。
     * reset 路径可能已持有 BQL，不能调用带 BQL_LOCK_GUARD 的 meip_resync。
     */
    if (env->wch_evt_mcause_override == CH32_USART1_NVIC_IRQ) {
        riscv_cpu_update_mip(env, MIP_MEIP, 0);
        env->wch_evt_mcause_override = 0;
        env->mie &= ~MIP_MEIP;
        ch32_pfic_irq_active_clear(m, CH32_USART1_NVIC_IRQ);
        riscv_cpu_interrupt(env);
    }
}

/* =========================================================
 * ch32_usart1_init_mr
 * ========================================================= */
void ch32_usart1_init_mr(Ch32MachineState *m, Object *owner)
{
    Chardev *cd = serial_hd(0);

    if (!cd) {
        error_report("ch32-usart1: no char backend (use -serial stdio or "
                     "-nographic)");
        exit(EXIT_FAILURE);
    }

    /* 初始状态：TXE=1, TC=1（手册复位值 0x00C0） */
    m->usart1.statr       = (uint16_t)(STATR_TXE | STATR_TC);
    m->usart1.tx_empty    = true;
    m->usart1.tx_complete = true;

    /* TX drain 定时器 */
    m->usart1.tx_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL,
                                       ch32_usart1_tx_drain, m);
    /* RX 节拍定时器：逐字节投喂，模拟串口字节间隔 */
    m->usart1.rx_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL,
                                       ch32_usart1_rx_tick, m);
    m->usart1.rx_stage_head = 0;
    m->usart1.rx_stage_tail = 0;

    memory_region_init_io(&m->usart1.iomem, owner, &ch32_usart1_ops, m,
                          "ch32-usart1", 0x400);
    qemu_chr_fe_init(&m->usart1.chr, cd, &error_fatal);
    qemu_chr_fe_set_handlers(&m->usart1.chr,
                             ch32_usart1_can_receive,
                             ch32_usart1_receive,
                             NULL, NULL, m, NULL, true);
}

/* =========================================================
 * USART2/3 + UART4~8 轻量级仿真（DMA1/DMA2 TX/RX）
 *
 * 无 char backend：TX 字节直接丢弃（仅记录 datar_last 供回路测试）。
 * RX DMA：固件写 DATAR 且 DMAR=1 时由 pump 将字节写入 DMA 指向的内存。
 * TX DMA：通用 DMA 引擎 Mem→Periph 写 DATAR；DMAT=1 由 CFGR.EN 自驱。
 *
 * UART4~8 的 DMA 请求映射：手册图 11-2 / 表 11-3（DMA2）。
 * ========================================================= */

typedef struct {
    uint8_t  dma_unit;   /* 1=DMA1，2=DMA2 */
    uint8_t  phys_rx_ch; /* 物理通道号 1~7（DMA1）或 1~11（DMA2） */
    uint32_t uart_base;
    unsigned dma_rx_irq;
} Ch32UartDmaRxCfg;

typedef struct {
    Ch32MachineState       *m;
    Ch32Usart23State       *u;
    const Ch32UartDmaRxCfg *rx_dma;
} Ch32UsartLiteOpaque;

/*
 * RX DMA 通道（手册表 11-2 DMA1；图 11-2 / 表 11-3 DMA2）：
 * USART2_RX = DMA1_Ch6；USART3_RX = DMA1_Ch3；
 * UART4_RX = DMA2_Ch3；UART5_RX = DMA2_Ch2；UART6_RX = DMA2_Ch7；
 * UART7_RX = DMA2_Ch9；UART8_RX = DMA2_Ch11。
 */
static const Ch32UartDmaRxCfg usart2_rx_dma = {
    1, 6, CH32_USART2_BASE, CH32_USART2_DMA_RX_IRQ,
};
static const Ch32UartDmaRxCfg usart3_rx_dma = {
    1, 3, CH32_USART3_BASE, CH32_USART3_DMA_RX_IRQ,
};
static const Ch32UartDmaRxCfg uart4_rx_dma = {
    2, 3, CH32_UART4_BASE, 74u,
};
static const Ch32UartDmaRxCfg uart5_rx_dma = {
    2, 2, CH32_UART5_BASE, 73u,
};
static const Ch32UartDmaRxCfg uart6_rx_dma = {
    2, 7, CH32_UART6_BASE, 99u,
};
