lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-usart.c
static const Ch32UartDmaRxCfg uart7_rx_dma = {
    2, 9, CH32_UART7_BASE, 101u,
};
static const Ch32UartDmaRxCfg uart8_rx_dma = {
    2, 11, CH32_UART8_BASE, 103u,
};

static Ch32DmaChannel *ch32_usart_lite_dma_ch(Ch32MachineState *m,
                                              const Ch32UartDmaRxCfg *cfg)
{
    if (!cfg) {
        return NULL;
    }
    if (cfg->dma_unit == 1u) {
        if (cfg->phys_rx_ch < 1u || cfg->phys_rx_ch > 7u) {
            return NULL;
        }
        return &m->dma.ch1[cfg->phys_rx_ch - 1u];
    }
    if (cfg->dma_unit == 2u) {
        if (cfg->phys_rx_ch < 1u || cfg->phys_rx_ch > 11u) {
            return NULL;
        }
        return &m->dma.ch2[cfg->phys_rx_ch - 1u];
    }
    return NULL;
}

static void ch32_usart_lite_dma_rx_finish(Ch32MachineState *m, Ch32DmaChannel *ch,
                                          const Ch32UartDmaRxCfg *cfg)
{
    uint32_t *intfr_reg;
    unsigned ch_local_bm;

    if (cfg->dma_unit == 1u) {
        intfr_reg = &m->dma.intfr[0];
        ch_local_bm = cfg->phys_rx_ch;
    } else {
        if (cfg->phys_rx_ch <= 7u) {
            intfr_reg = &m->dma.intfr[1];
            ch_local_bm = cfg->phys_rx_ch;
        } else {
            intfr_reg = &m->dma.intfr[2];
            ch_local_bm = cfg->phys_rx_ch - 7u;
        }
    }
    ch32_dma_finish_channel(m, ch, intfr_reg, ch_local_bm, cfg->dma_rx_irq);
}

/*
 * ch32_usart_lite_dma_rx_pump — RX DMA 单字节搬运（DATAR 模拟源）
 */
static void ch32_usart_lite_dma_rx_pump(Ch32MachineState *m, Ch32Usart23State *u,
                                        const Ch32UartDmaRxCfg *cfg)
{
    Ch32DmaChannel *ch;
    uint32_t expected;
    uint8_t byte;

    if (!u->rx_pending || !cfg) {
        return;
    }
    ch = ch32_usart_lite_dma_ch(m, cfg);
    if (!ch) {
        return;
    }
    if (!(ch->cfgr & (1u << 0)) || ch->cntr == 0) {
        return;
    }
    expected = cfg->uart_base + 0x04u;
    if (ch->paddr < expected || ch->paddr > expected + 3u) {
        return;
    }

    byte = u->datar_last;
    u->rx_pending = false;

    ch32_dma_write_byte(ch, byte);
    ch->cntr--;

    if (ch->cntr == 0) {
        ch32_usart_lite_dma_rx_finish(m, ch, cfg);
    }
}

/* ---------- RX 小 FIFO（中断路径）；DMAR=1 时仍走 datar_last + rx_pending ---------- */

static bool lite_rxfifo_empty(const Ch32Usart23State *u)
{
    return u->rx_fifo_h == u->rx_fifo_t;
}

static bool lite_rxfifo_full(const Ch32Usart23State *u)
{
    return ((u->rx_fifo_t + 1u) % CH32_USART_LITE_RXFIFO_DEPTH) == u->rx_fifo_h;
}

static void lite_rxfifo_push(Ch32Usart23State *u, uint8_t b)
{
    unsigned next = (u->rx_fifo_t + 1u) % CH32_USART_LITE_RXFIFO_DEPTH;

    u->rx_fifo[u->rx_fifo_t] = b;
    u->rx_fifo_t = next;
}

static uint8_t lite_rxfifo_pop(Ch32Usart23State *u)
{
    uint8_t b = u->rx_fifo[u->rx_fifo_h];

    u->rx_fifo_h = (u->rx_fifo_h + 1u) % CH32_USART_LITE_RXFIFO_DEPTH;
    return b;
}

static uint16_t ch32_usart_lite_statr_hw(const Ch32Usart23State *u)
{
    /*
     * 轻量 TX：无移位寄存器时序，TXE|TC 恒 1（宽松）。
     * 为避免 TXEIE/TCIE 恒真导致 MEIP 风暴，USART2~UART8 的 PFIC 同步**仅考察 RXNE**。
     * RXNE 仅反映 RX FIFO（外部 push 或后续扩展）；DMAR 字节仍走 DMA，不占 RXNE。
     */
    uint16_t st = (uint16_t)(STATR_TXE | STATR_TC);

    if (!lite_rxfifo_empty(u)) {
        st |= STATR_RXNE;
    }
    return st;
}

/*
 * usart_lite_meip_one — 单实例 PFIC/MEIP（逻辑对齐 ch32_usart1_meip_resync，IRQ 号各异）。
 */
static void usart_lite_meip_one(Ch32MachineState *m, Ch32Usart23State *u,
                                unsigned irq_n)
{
    RISCVCPU *cpu = &m->cpus.harts[0];
    CPURISCVState *env = &cpu->env;
    unsigned wd  = irq_n / 32u;
    unsigned bit = irq_n % 32u;
    bool ienr_on = (m->pfic_ienr[wd] >> bit) & 1u;

    uint16_t st = ch32_usart_lite_statr_hw(u);
    uint32_t c1 = u->ctlr1;

    bool irq = ienr_on && ((c1 & CTLR1_RXNEIE) && (st & STATR_RXNE));

    BQL_LOCK_GUARD();

    if (irq) {
        if (env->wch_evt_mcause_override != 0u &&
            env->wch_evt_mcause_override != irq_n) {
            return;
        }
        env->mie |= MIP_MEIP;
        env->wch_evt_mcause_override = irq_n;
        ch32_pfic_irq_active_set(m, irq_n);
        riscv_cpu_update_mip(env, MIP_MEIP, MIP_MEIP);
    } else {
        if (env->wch_evt_mcause_override == irq_n) {
            if (env->wch_vtf_in_isr > 0) {
                riscv_cpu_update_mip(env, MIP_MEIP, 0);
            } else {
                riscv_cpu_update_mip(env, MIP_MEIP, 0);
                env->wch_evt_mcause_override = 0;
                ch32_pfic_irq_active_clear(m, irq_n);
                ch32_pfic_resync_pending_meip(m);
            }
        }
    }
    riscv_cpu_interrupt(env);
}

void ch32_usart_lite_meip_resync(Ch32MachineState *m)
{
    static const unsigned lite_irq[7] = {
        CH32_USART2_NVIC_IRQ, CH32_USART3_NVIC_IRQ,
        CH32_UART4_NVIC_IRQ, CH32_UART5_NVIC_IRQ,
        CH32_UART6_NVIC_IRQ, CH32_UART7_NVIC_IRQ, CH32_UART8_NVIC_IRQ,
    };
    Ch32Usart23State *units[7];
    unsigned i;

    units[0] = &m->usart2;
    units[1] = &m->usart3;
    units[2] = &m->usart4;
    units[3] = &m->usart5;
    units[4] = &m->usart6;
    units[5] = &m->usart7;
    units[6] = &m->usart8;

    for (i = 0; i < 7u; i++) {
        usart_lite_meip_one(m, units[i], lite_irq[i]);
    }
}

void ch32_usart_lite_push_rx_byte(Ch32MachineState *m, unsigned idx, uint8_t b)
{
    Ch32Usart23State *u;

    switch (idx) {
    case 0: u = &m->usart2; break;
    case 1: u = &m->usart3; break;
    case 2: u = &m->usart4; break;
    case 3: u = &m->usart5; break;
    case 4: u = &m->usart6; break;
    case 5: u = &m->usart7; break;
    case 6: u = &m->usart8; break;
    default: return;
    }
    if (lite_rxfifo_full(u)) {
        return;
    }
    lite_rxfifo_push(u, b);
    ch32_usart_lite_meip_resync(m);
}

static uint64_t ch32_usart_lite_read(void *opaque, hwaddr addr, unsigned size)
{
    Ch32UsartLiteOpaque *op = opaque;
    Ch32MachineState *m = op->m;
    Ch32Usart23State *u = op->u;

    switch (addr) {
    case 0x00: /* STATR */
        {
            uint16_t st = ch32_usart_lite_statr_hw(u);
            return (size == 1) ? (st & 0xffu) : st;
        }
    case 0x04: /* DATAR 读 RDR：先消费 RX FIFO */
        {
            uint32_t ret = (uint32_t)u->datar_last;

            if (!lite_rxfifo_empty(u)) {
                ret = lite_rxfifo_pop(u);
                u->datar_last = (uint8_t)ret;
            }
            ch32_usart_lite_meip_resync(m);
            return (size == 1) ? (ret & 0xffu) : ret;
        }
    case 0x08:
        return u->brr;
    case 0x0c:
        return u->ctlr1;
    case 0x10:
        return u->ctlr2;
    case 0x14:
        return u->ctlr3;
    case 0x18:
        return u->gpr;
    case 0x1c:
        return u->ctlr4;
    default:
        return 0;
    }
}

static void ch32_usart_lite_write(void *opaque, hwaddr addr, uint64_t val,
                                  unsigned size)
{
    Ch32UsartLiteOpaque *op = opaque;
    Ch32MachineState *m = op->m;
    Ch32Usart23State *u = op->u;
    uint32_t v = (uint32_t)val;

    (void)size;

    switch (addr) {
    case 0x00: /* STATR：RW0 位写 0 清（与 USART1 一致，仅处理 RXNE） */
        {
            uint16_t clr = (uint16_t)(~v & STATR_W0C_MASK);

            if ((clr & STATR_RXNE) && !lite_rxfifo_empty(u)) {
                (void)lite_rxfifo_pop(u);
            }
            ch32_usart_lite_meip_resync(m);
        }
        return;
    case 0x04: /* DATAR 写 = TDR */
        u->datar_last = (uint8_t)(v & 0xffu);
        if (u->ctlr3 & CTLR3_DMAR) {
            u->rx_pending = true;
            ch32_usart_lite_dma_rx_pump(m, u, op->rx_dma);
        }
        return;
    case 0x08:
        u->brr = v;
        return;
    case 0x0c:
        u->ctlr1 = v;
        ch32_usart_lite_meip_resync(m);
        return;
    case 0x10:
        u->ctlr2 = v;
        return;
    case 0x14:
        u->ctlr3 = v;
        ch32_usart_lite_meip_resync(m);
        return;
    case 0x18:
        u->gpr = v;
        return;
    case 0x1c:
        u->ctlr4 = v;
        return;
    default:
        return;
    }
}

static const MemoryRegionOps ch32_usart_lite_ops = {
    .read  = ch32_usart_lite_read,
    .write = ch32_usart_lite_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
    },
};

