lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-usart.c
static Ch32UsartLiteOpaque usart_lite_op[7];

static void ch32_usart_lite_one_init(Ch32MachineState *m, Object *owner,
                                     Ch32UsartLiteOpaque *op, Ch32Usart23State *u,
                                     const Ch32UartDmaRxCfg *rx_dma,
                                     const char *name)
{
    op->m = m;
    op->u = u;
    op->rx_dma = rx_dma;
    u->statr = (uint16_t)(STATR_TXE | STATR_TC);
    u->brr = 0;
    u->ctlr1 = 0;
    u->ctlr2 = 0;
    u->ctlr3 = 0;
    u->gpr = 0;
    u->ctlr4 = 0;
    u->datar_last = 0;
    u->rx_pending = false;
    u->rx_fifo_h = 0;
    u->rx_fifo_t = 0;
    memset(u->rx_fifo, 0, sizeof(u->rx_fifo));
    memory_region_init_io(&u->iomem, owner, &ch32_usart_lite_ops, op, name,
                          CH32_USART_STUB_SIZE);
}

void ch32_usart_lite_init_mr(Ch32MachineState *m, Object *owner)
{
    ch32_usart_lite_one_init(m, owner, &usart_lite_op[0], &m->usart2,
                             &usart2_rx_dma, "ch32-usart2");
    ch32_usart_lite_one_init(m, owner, &usart_lite_op[1], &m->usart3,
                             &usart3_rx_dma, "ch32-usart3");
    ch32_usart_lite_one_init(m, owner, &usart_lite_op[2], &m->usart4,
                             &uart4_rx_dma, "ch32-uart4");
    ch32_usart_lite_one_init(m, owner, &usart_lite_op[3], &m->usart5,
                             &uart5_rx_dma, "ch32-uart5");
    ch32_usart_lite_one_init(m, owner, &usart_lite_op[4], &m->usart6,
                             &uart6_rx_dma, "ch32-uart6");
    ch32_usart_lite_one_init(m, owner, &usart_lite_op[5], &m->usart7,
                             &uart7_rx_dma, "ch32-uart7");
    ch32_usart_lite_one_init(m, owner, &usart_lite_op[6], &m->usart8,
                             &uart8_rx_dma, "ch32-uart8");
}

void ch32_usart_lite_reset(Ch32MachineState *m)
{
    Ch32Usart23State *units[] = {
        &m->usart2, &m->usart3, &m->usart4, &m->usart5,
        &m->usart6, &m->usart7, &m->usart8,
    };
    unsigned i;

    for (i = 0; i < ARRAY_SIZE(units); i++) {
        Ch32Usart23State *u = units[i];

        u->statr = (uint16_t)(STATR_TXE | STATR_TC);
        u->brr = 0;
        u->ctlr1 = 0;
        u->ctlr2 = 0;
        u->ctlr3 = 0;
        u->gpr = 0;
        u->ctlr4 = 0;
        u->datar_last = 0;
        u->rx_pending = false;
        u->rx_fifo_h = 0;
        u->rx_fifo_t = 0;
        memset(u->rx_fifo, 0, sizeof(u->rx_fifo));
    }
}
